xml-resources/web-service-references/AuthorizationService_singleWsdl/wsdl/ds.dyndns.org_9000/AuthorizationService.singlewsdl.wsdl

<?xml version="1.0" encoding="ISO-8859-1"?>
<wsdl:definitions xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://ISTP1.Service.Contracts.Service" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://ISTP1.Service.Contracts.Service" name="LoginService">
<wsdl:types>
<xs:schema targetNamespace="http://ISTP1.Service.Contracts.Service" xmlns:xs="http://www.w3.org/2001/XMLSchema" elementFormDefault="qualified">
<xs:import namespace="http://schemas.datacontract.org/2004/07/SGE.Service.Contracts.Data"/>
<xs:element name="SolicitarAutorizacion">
<xs:complexType>
<xs:sequence>
<xs:element name="codigo" type="xs:string" nillable="true" minOccurs="0"/>
</xs:sequence>
</xs:complexType>
</xs:element>
<xs:element name="SolicitarAutorizacionResponse">
<xs:complexType>
<xs:sequence>
<xs:element name="SolicitarAutorizacionResult" type="q1:Autorizacion" nillable="true" minOccurs="0" xmlns:q1="http://schemas.datacontract.org/2004/07/SGE.Service.Contracts.Data"/>
</xs:sequence>
</xs:complexType>
</xs:element>
</xs:schema>
<xs:schema xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" elementFormDefault="qualified" attributeFormDefault="qualified">
<xs:element name="anyType" type="xs:anyType" nillable="true"/>
<xs:element name="anyURI" type="xs:anyURI" nillable="true"/>
<xs:element name="base64Binary" type="xs:base64Binary" nillable="true"/>
<xs:element name="boolean" type="xs:boolean" nillable="true"/>
<xs:element name="byte" type="xs:byte" nillable="true"/>
<xs:element name="dateTime" type="xs:dateTime" nillable="true"/>
<xs:element name="decimal" type="xs:decimal" nillable="true"/>
<xs:element name="double" type="xs:double" nillable="true"/>
<xs:element name="float" type="xs:float" nillable="true"/>
<xs:element name="int" type="xs:int" nillable="true"/>
<xs:element name="long" type="xs:long" nillable="true"/>
<xs:element name="QName" type="xs:QName" nillable="true"/>
<xs:element name="short" type="xs:short" nillable="true"/>
<xs:element name="string" type="xs:string" nillable="true"/>
<xs:element name="unsignedByte" type="xs:unsignedByte" nillable="true"/>
<xs:element name="unsignedInt" type="xs:unsignedInt" nillable="true"/>
<xs:element name="unsignedLong" type="xs:unsignedLong" nillable="true"/>
<xs:element name="unsignedShort" type="xs:unsignedShort" nillable="true"/>
<xs:element name="char" type="tns:char" nillable="true"/>
<xs:simpleType name="char">
<xs:restriction base="xs:int"/>
</xs:simpleType>
<xs:element name="duration" type="tns:duration" nillable="true"/>
<xs:simpleType name="duration">
<xs:restriction base="xs:duration">
<xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/>
<xs:minInclusive value="-P10675199DT2H48M5.4775808S"/>
<xs:maxInclusive value="P10675199DT2H48M5.4775807S"/>
</xs:restriction>
</xs:simpleType>
<xs:element name="guid" type="tns:guid" nillable="true"/>
<xs:simpleType name="guid">
<xs:restriction base="xs:string">
<xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/>
</xs:restriction>
</xs:simpleType>
<xs:attribute name="FactoryType" type="xs:QName"/>
<xs:attribute name="Id" type="xs:ID"/>
<xs:attribute name="Ref" type="xs:IDREF"/>
</xs:schema>
<xs:schema xmlns:tns="http://schemas.datacontract.org/2004/07/SGE.Service.Contracts.Data" targetNamespace="http://schemas.datacontract.org/2004/07/SGE.Service.Contracts.Data" xmlns:xs="http://www.w3.org/2001/XMLSchema" elementFormDefault="qualified">
<xs:complexType name="Autorizacion">
<xs:sequence>
<xs:element name="Cuit" type="xs:long" minOccurs="0"/>
<xs:element name="Error" type="xs:string" nillable="true" minOccurs="0"/>
<xs:element name="Sign" type="xs:string" nillable="true" minOccurs="0"/>
<xs:element name="Token" type="xs:string" nillable="true" minOccurs="0"/>
</xs:sequence>
</xs:complexType>
<xs:element name="Autorizacion" type="tns:Autorizacion" nillable="true"/>
</xs:schema>
</wsdl:types>
<wsdl:message name="ILoginService_SolicitarAutorizacion_InputMessage">
<wsdl:part name="parameters" element="tns:SolicitarAutorizacion"/>
</wsdl:message>
<wsdl:message name="ILoginService_SolicitarAutorizacion_OutputMessage">
<wsdl:part name="parameters" element="tns:SolicitarAutorizacionResponse"/>
</wsdl:message>
<wsdl:portType name="ILoginService">
<wsdl:operation name="SolicitarAutorizacion">
<wsdl:input message="tns:ILoginService_SolicitarAutorizacion_InputMessage" wsaw:Action="http://ISTP1.Service.Contracts.Service/ILoginService/SolicitarAutorizacion"/>
<wsdl:output message="tns:ILoginService_SolicitarAutorizacion_OutputMessage" wsaw:Action="http://ISTP1.Service.Contracts.Service/ILoginService/SolicitarAutorizacionResponse"/>
</wsdl:operation>
</wsdl:portType>
<wsdl:binding name="SGEAuthService" type="tns:ILoginService">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
<wsdl:operation name="SolicitarAutorizacion">
<soap:operation style="document" soapAction="http://ISTP1.Service.Contracts.Service/ILoginService/SolicitarAutorizacion"/>
<wsdl:input>
<soap:body use="literal"/>
</wsdl:input>
<wsdl:output>
<soap:body use="literal"/>
</wsdl:output>
</wsdl:operation>
</wsdl:binding>
<wsdl:service name="LoginService">
<wsdl:port name="SGEAuthService" binding="tns:SGEAuthService">
<soap:address location="http://ds.dyndns.org:9000/AuthorizationService"/>
</wsdl:port>
</wsdl:service>
</wsdl:definitions>